[
    {
        "date": "2022-03-11 17:42:38",
        "review": "By the time the activities have loaded by 2 year old has lost interest and run away. Also doesn’t give him time to respond… although I do find after we have closed the app he has repeated the animal sounds a little bit, he hasn’t learnt words yet",
        "rating": 3,
        "isEdited": false,
        "title": "Slow loading",
        "userName": "Lizziefloody"
    },
    {
        "date": "2020-06-25 07:49:45",
        "developerResponse": {
            "id": 16285118,
            "body": "Hi there!!! Woooow :D We are very glad to know that your little ones are having a blast with Speech Blubs :D Every day we develop our app having the little ones in mind. In case that you also enjoy our work, remember that you can talk with us by sending an email at hi@blubblub.org! Tell us which is your kid's favorite section :)",
            "modified": "2020-06-29T11:50:55Z"
        },
        "review": "We find this app very easy to deal with, our 4 years old scrolls through it at ease and the design is fantastic as images are self explanatory. \nBoth of my kids (4 and 2) love spending time using multiple sections of the app.\nI found the options to pause the videos very useful as I can focus on my kids repeating the word and correcting them when needed.\nAlso, the info provided when you complete the activity is useful and entertaining.\nLove this app!",
        "rating": 5,
        "isEdited": false,
        "title": "Engaging and fun for our kids",
        "userName": "Carlogi"
    },
    {
        "date": "2018-09-05 09:25:38",
        "developerResponse": {
            "id": 4957348,
            "body": "Wow! Thank you so much! Reviews like yours put a huge smile on our face. Stories like yours are the reason why we are still in the business. It's why we go to work every day and making Speech Blubs app better and better. So thank you so much, we'll print it out and put on our wall. The reason I’m writing is to ask for a little more feedback about how you and your child(ren) are using Speech Blubs and what you find so engaging about it? We have a special proposition if you’re up for it. Send us a short email to hi@blubblub.org and we'll tell you more about it.This is the only way we can get in touch with you.",
            "modified": "2018-09-06T05:08:03Z"
        },
        "review": "I’m no speech therapist but my kid wasn’t talking - I couldn’t for the life of me get him to mimic sounds. Maybe it’s the wee kiddy faces making the sounds, or it’s the silly motivational reward videos at the end of the sound segments, but he is FINALLY making some serious and noticeable progress and trying his damndest to mimic noises. Cheers guys!",
        "rating": 5,
        "isEdited": false,
        "title": "Thumbs up!",
        "userName": "victariffic"
    },
    {
        "date": "2022-12-13 04:27:06",
        "developerResponse": {
            "id": 34228342,
            "body": "Hello! Thank you for the valuable feedback! If you have any more to share, send us an e-mail to ios@speechblubs.com! Kind regards.",
            "modified": "2023-01-11T15:11:22Z"
        },
        "review": "Good app but the little house button (home) is son distracting and annoying- my kid keeps pushing it!\nCan you hide this?!",
        "rating": 3,
        "isEdited": false,
        "userName": "budsnz",
        "title": "Home button is a distraction"
    },
    {
        "date": "2022-01-29 01:25:29",
        "review": "I wanted to do the 7 day free trial, unfortunately wasn’t exactly what we expected. I canceled the subscription the day after I started the trial. A week later $99 got taken out of my bank account. It has taken me 3 days to get ahold of them. Yes they said they will be refunding the money but may take up to two weeks!\nHorrible experience wouldn’t recommend!",
        "rating": 1,
        "isEdited": false,
        "title": "Don’t do free trial!",
        "userName": "Kays.S"
    },
    {
        "date": "2020-07-02 18:43:57",
        "developerResponse": {
            "id": 16145655,
            "body": "WOOOW! We love to hear that! Thank you for your nice review! Would you like to share your thoughts with us? Send us an email at hi@blubblub.org and let's have a conversation! :D",
            "modified": "2020-07-02T18:43:57Z"
        },
        "review": "The best app to date worth every penny and some \nOur son has a speech delay and tis is the best support to go alongside his therapy sessions \nDefinitely recommend",
        "rating": 5,
        "isEdited": true,
        "userName": "jakeyfart",
        "title": "Fantastic support tool"
    },
    {
        "date": "2019-08-25 01:30:20",
        "developerResponse": {
            "id": 10352617,
            "body": "Wow that is great! We are thrilled to know that you like our app, we hope you find it really useful and we manage to help with some words :) If you have any concern or feedback that would like to share with us don't hesitate to write to us at hi@blubblub.org. We will be really happy to speak to you! Have a wonderful day!",
            "modified": "2019-08-26T09:39:10Z"
        },
        "review": "I just tried the trial version and planning to purchase it for my 20 month old daughter!",
        "rating": 5,
        "isEdited": false,
        "title": "Amazing!",
        "userName": "cayca"
    },
    {
        "date": "2021-10-01 06:12:40",
        "review": "Honestly I feel that my kid try to repeat the words",
        "rating": 5,
        "isEdited": false,
        "title": "Effective",
        "userName": "kpitoo"
    },
    {
        "date": "2022-05-18 05:02:58",
        "review": "This game is the best.",
        "rating": 5,
        "isEdited": false,
        "title": "Best game",
        "userName": "powergirl2402"
    },
    {
        "date": "2021-08-19 05:35:48",
        "review": "Couldn’t get any of the games to finish loading (they got to about 95% and stopped). If you unsubscribe before the 7 days is up you cannot access the app again to finish the free trial",
        "rating": 1,
        "isEdited": false,
        "title": "No games loaded",
        "userName": "Kirstypants2211"
    },
    {
        "date": "2019-12-29 20:33:29",
        "review": "Beware you’ll be billed straightaway before trail week",
        "rating": 1,
        "isEdited": false,
        "title": "No free 1 week",
        "userName": "Rajthota"
    },
    {
        "date": "2019-07-01 06:05:10",
        "developerResponse": {
            "id": 9456646,
            "body": "Hello there! We are really happy to know that! Thank you for using our app, have a wonderful day!",
            "modified": "2019-07-02T07:55:39Z"
        },
        "review": "Harry loves this app",
        "rating": 5,
        "isEdited": false,
        "title": "Review",
        "userName": "Harrynicpenny82"
    },
    {
        "date": "2020-08-25 03:40:58",
        "developerResponse": {
            "id": 17537535,
            "body": "Hey Jengrbin,\nThank you so much for such a great review! We are always so happy to see parents and children enjoying Speech Blubs!\nJust to let you know, with your subscription, you also have access to our new app, Reading Blubs! This time it’s all about learning letters, words, and becoming a reader! We kindly invite you to give it a try, you can find it here:\nhttps://apps.apple.com/us/app/id1523044077\nAfter you download it, just log in with your Speech Blubs account (capitalization is important). And, if you could leave a review of Reading Blubs aferwards, it would mean the world to us!",
            "modified": "2020-08-27T11:27:45Z"
        },
        "review": "Mum son finds it really engaging",
        "rating": 5,
        "isEdited": false,
        "userName": "jengrbin",
        "title": "Awesomeopplkj hmmm yuhuyuoillmn b bbvvcccccxxzt xx p"
    },
    {
        "date": "2020-05-06 04:33:24",
        "review": "Can’t believe your process is to down load your app - collect personal of our children, agree to recieve notifications, use our location. Hook us into filling the questions, provide a report then ask for $26.00\n\nSomeone needs to make a serious complaint to authorities. A bit of transparency would go along way. What a scam",
        "rating": 1,
        "isEdited": false,
        "userName": "sickofdatascams",
        "title": "Collecting Children’s Data"
    },
    {
        "date": "2019-12-05 01:34:30",
        "developerResponse": {
            "id": 12248261,
            "body": "Hi there, If you were charged this amount that means that you choose the annual plan, there is no way from our side to change your subscription or force you to pay without consent. We apologize for the inconvenience and we suggest you send an email to hi@blubblub.org. There we will tell you how to ask for a refund.",
            "modified": "2019-12-06T09:17:17Z"
        },
        "review": "I opted for 7 day free trial with monthly renewal of $8.99 \n7 day trial ended and a whole year subscription $99.99 was taken from my apple account! \nNot happy at all! Very misleading",
        "rating": 1,
        "isEdited": false,
        "title": "Ripped off",
        "userName": "Marz989"
    }
]